Tekla Open API Reference for Tekla Structures 2025
DimensionLink Constructor
 Creates a new DimensionLink instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionLink(
	StraightDimensionSet Dimension1,
	StraightDimensionSet Dimension2
)
Public Sub New (
	Dimension1 As StraightDimensionSet,
	Dimension2 As StraightDimensionSet
)
Parameters
Dimension1
Type: Tekla.Structures.Drawing.StraightDimensionSet
The first dimension set to be linked.
Dimension2
Type: Tekla.Structures.Drawing.StraightDimensionSet
The second dimension set to be linked.
See Also
Reference
DimensionLink Class
Tekla.Structures.Drawing Namespace